results/ASPLOS/WILDFIRE/YCSB-ROCKSDB-CORUN-200sec/50M-KEYS/8/batchsize-128/ycsbwkldf/CIPI_PERF.out
Setting g_min_fd 4 
Setting g_min_fd 4 
RocksDB:    version 5.4
Date:       Sun Mar  3 21:25:30 2024
CPU:        128 * AMD EPYC 7543 32-Core Processor
CPUCache:   512 KB
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Keys:       20 bytes each
Values:     4096 bytes each (2048 bytes after compression)
Entries:    50000000
Prefix:    20 bytes
Keys per prefix:    0
RawSize:    196266.2 MB (estimated)
FileSize:   98609.9 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Memtablerep: prefix_hash
Perf Level: 1
------------------------------------------------
DB path: [/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/DATA]
ycsbwkldf    :      22.537 micros/op 44371 ops/sec; ( reads:559563 writes:557436 total:50000000 found:559563)
	Command being timed: "/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/db_bench --db=/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/DATA --num_levels=6 --key_size=20 --prefix_size=20 --memtablerep=prefix_hash --bloom_bits=10 --bloom_locality=1 --use_existing_db=1 --num=50000000 --duration=200 --compression_type=none --value_size=4096 --threads=8 --benchmarks=ycsbwkldf --use_existing_db=1 --mmap_read=0 --threads=8"
	User time (seconds): 281.71
	System time (seconds): 276.19
	Percent of CPU this job got: 269%
	Elapsed (wall clock) time (h:mm:ss or m:ss): 3:27.17
	Average shared text size (kbytes): 0
	Average unshared data size (kbytes): 0
	Average stack size (kbytes): 0
	Average total size (kbytes): 0
	Maximum resident set size (kbytes): 1966464
	Average resident set size (kbytes): 0
	Major (requiring I/O) page faults: 67
	Minor (reclaiming a frame) page faults: 7280495
	Voluntary context switches: 26687954
	Involuntary context switches: 7926
	Swaps: 0
	File system inputs: 60827216
	File system outputs: 212782176
	Socket messages sent: 0
	Socket messages received: 0
	Signals delivered: 0
	Page size (bytes): 4096
	Exit status: 0
[83263.748113] sh (250711): drop_caches: 3
[83263.810539] sh (250718): drop_caches: 3
[83298.056886] write_proc_unbounded: Value of write = 1
[83298.056899] write_proc_2mb_limit: Value of write = 1
[83298.056905] write_proc_bitmap_shift: Value of write = 38
[83298.063020] write_proc_unbounded: Value of write = 1
[83298.063033] write_proc_2mb_limit: Value of write = 1
[83298.063038] write_proc_bitmap_shift: Value of write = 38
[83505.131798] write_proc_unbounded: Value of write = 0
[83505.131809] write_proc_2mb_limit: Value of write = 0
[83505.233155] write_proc_unbounded: Value of write = 0
[83505.233169] write_proc_2mb_limit: Value of write = 0